window.addEventListener("load",function(){
    const data = [
    {
      name: "北京",
      city: [
        {
          name: "北京",
          area: [
            "东城区",
            "西城区",
            "朝阳区",
            "丰台区",
            "石景山区",
            "海淀区",
            "门头沟区",
            "房山区",
            "通州区",
            "顺义区",
            "昌平区",
            "大兴区",
            "平谷区",
            "怀柔区",
            "密云区",
            "延庆区"
          ]
        }
      ]
    },
    {
      name: "天津",
      city: [
        {
          name: "天津",
          area: [
            "和平区",
            "河东区",
            "河西区",
            "南开区",
            "河北区",
            "红桥区",
            "东丽区",
            "西青区",
            "津南区",
            "北辰区",
            "武清区",
            "宝坻区",
            "滨海新区",
            "宁河区",
            "静海区",
            "蓟州区"
          ]
        }
      ]
    }, 
    {
      name: "河北",
      city: [
        {
          name: "石家庄",
          area: [
            "长安区",
            "桥西区",
            "新华区",
            "裕华区",
            "栾城区",
            "藁城区",
            "鹿泉区",
            "井陉矿区",
            "鹿泉区",
            "辛集市",
            "晋州市",
            "新乐市",
            "赵县",
            "平山县",
            "正定县",
            "灵寿县",
            "高邑县",
            "赞皇县",
            "深泽县",
            "无极县",
            "行唐县",
            "元氏县",
            "井陉县",
            "其他"
          ]
        },
  
        {
          name: "唐山",
          area: [
            "路南区",
            "路北区",
            "古冶区",
            "开平区",
            "丰南区",
            "丰润区",
            "曹妃甸区",
            "遵化市",
            "滦州市",
            "迁安市",
            "玉田县",
            "乐亭县",
            "迁西县",
            "滦南县",
            "其他"
          ]
        },
        {
          name: "邯郸",
          area: [
            "丛台区",
            "复兴区",
            "邯山区",
            "永年区",
            "肥乡区",
            "峰峰矿区",
            "武安市",
            "邱县",
            "磁县",
            "魏县",
            "涉县",
            "曲周县",
            "馆陶县",
            "成安县",
            "大名县",
            "鸡泽县",
            "广平县",
            "临漳县",
            "其他"
          ]
        },
        {
          name: "张家口",
          area: [
            "桥西区",
            "桥东区",
            "宣化区",
            "崇礼区",
            "万全区",
            "下花园区",
            "蔚县",
            "康保县",
            "张北县",
            "阳原县",
            "赤城县",
            "怀来县",
            "涿鹿县",
            "沽源县",
            "怀安县",
            "尚义县",
            "其他"
          ]
        },
        {
          name: "保定",
          area: [
            "竞秀区",
            "莲池区",
            "清苑区",
            "徐水区",
            "满城区",
            "安国市",
            "涿州市",
            "定州市",
            "高碑店市",
            "雄县",
            "唐县",
            "易县",
            "蠡县",
            "安新县",
            "容城县",
            "涞水县",
            "阜平县",
            "定兴县",
            "高阳县",
            "涞源县",
            "望都县",
            "曲阳县",
            "顺平县",
            "博野县",
            "其他"
          ]
        },
        {
          name: "秦皇岛",
          area: [
            "海港区",
            "抚宁区",
            "山海关区",
            "北戴河区",
            "青龙满族自治县",
            "昌黎县",
            "卢龙县",
            "其他"
          ]
        },
        {
          name: "承德",
          area: [
            "双桥区",
            "双滦区",
            "鹰手营子矿区",
            "平泉市",
            "承德县",
            "兴隆县",
            "隆化县",
            "滦平县",
            "丰宁满族自治县",
            "宽城满族自治县",
            "围场满族蒙古族自治县",
            "其他"
          ]
        },
        {
          name: "邢台",
          area: [
            "桥东区",
            "桥西区",
            "南宫市",
            "沙河市",
            "任县",
            "威县",
            "邢台县",
            "清河县",
            "柏乡县",
            "宁晋县",
            "隆尧县",
            "临城县",
            "广宗县",
            "临西县",
            "内丘县",
            "平乡县",
            "巨鹿县",
            "新河县",
            "南和县",
            "其他"
          ]
        },
        {
          name: "沧州",
          area: [
            "运河区",
            "新华区",
            "河间市",
            "泊头市",
            "黄骅市",
            "任丘市",
            "沧县",
            "青县",
            "献县",
            "东光县",
            "海兴县",
            "盐山县",
            "肃宁县",
            "南皮县",
            "吴桥县",
            "孟村回族自治县",
            "其他"
          ]
        },
        {
          name: "衡水",
          area: [
            "桃城区",
            "冀州区",
            "深州市",
            "景县",
            "饶阳县",
            "枣强县",
            "故城县",
            "阜城县",
            "安平县",
            "武邑县",
            "武强县",
            "其他"
          ]
        },
        {
          name: "廊坊",
          area: [
            "广阳区",
            "安次区",
            "霸州市",
            "三河市",
            "固安县",
            "永清县",
            "大城县",
            "文安县",
            "香河县",
            "大厂回族自治县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "山西",
      city: [
        {
          name: "太原",
          area: [
            "迎泽区",
            "小店区",
            "晋源区",
            "杏花岭区",
            "尖草坪区",
            "万柏林区",
            "古交市",
            "清徐县",
            "娄烦县",
            "阳曲县",
            "其他"
          ]
        },
        {
          name: "长治",
          area: [
            "潞州区",
            "上党区",
            "潞城区",
            "屯留区",
            "长子县",
            "沁县",
            "沁源县",
            "平顺县",
            "武乡县",
            "襄垣县",
            "黎城县",
            "壶关县",
            "其他"
          ]
        },
        {
          name: "大同",
          area: [
            "平城区",
            "云冈区",
            "新荣区",
            "云州区",
            "左云县",
            "阳高县",
            "浑源县",
            "天镇县",
            "广灵县",
            "灵丘县",
            "其他"
          ]
        },
        {
          name: "阳泉",
          area: ["城区", "郊区", "矿区", "盂县", "平定县", "其他"]
        },
        {
          name: "晋中",
          area: [
            "榆次区",
            "太谷区",
            "介休市",
            "祁县",
            "寿阳县",
            "昔阳县",
            "平遥县",
            "灵石县",
            "左权县",
            "和顺县",
            "榆社县",
            "其他"
          ]
        },
        {
          name: "朔州",
          area: [
            "朔城区",
            "平鲁区",
            "怀仁市",
            "山阴县",
            "应  县",
            "右玉县",
            "其他"
          ]
        },
        {
          name: "临汾",
          area: [
            "尧都区",
            "侯马市",
            "霍州市",
            "古县",
            "吉县",
            "隰县",
            "蒲县",
            "曲沃县",
            "翼城县",
            "襄汾县",
            "洪洞县",
            "安泽县",
            "浮山县",
            "乡宁县",
            "大宁县",
            "永和县",
            "汾西县",
            "其他"
          ]
        },
        {
          name: "忻州",
          area: [
            "忻府区",
            "原平市",
            "代县",
            "定襄县",
            "五台县",
            "繁峙县",
            "宁武县",
            "静乐县",
            "神池县",
            "五寨县",
            "岢岚县",
            "河曲县",
            "保德县",
            "偏关县",
            "其他"
          ]
        },
        {
          name: "吕梁",
          area: [
            "离石区",
            "孝义市",
            "汾阳市",
            "文水县",
            "交城县",
            "兴  县",
            "临  县",
            "柳林县",
            "石楼县",
            "岚  县",
            "方山县",
            "中阳县",
            "交口县",
            "其他"
          ]
        },
        {
          name: "运城",
          area: [
            "盐湖区",
            "永济市",
            "河津市",
            "夏县",
            "绛县",
            "新绛县",
            "临猗县",
            "万荣县",
            "闻喜县",
            "稷山县",
            "垣曲县",
            "平陆县",
            "芮城县",
            "其他"
          ]
        },
        {
          name: "晋城",
          area: [
            "城  区",
            "高平市",
            "沁水县",
            "阳城县",
            "陵川县",
            "泽州县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "内蒙古",
      city: [
        {
          name: "呼和浩特",
          area: [
            "新城区",
            "回民区",
            "玉泉区",
            "赛罕区",
            "土默特左旗",
            "托克托县",
            "和林格尔县",
            "清水河县",
            "武川县",
            "其他"
          ]
        },
  
        {
          name: "包头",
          area: [
            "昆都仑区",
            "东河区",
            "青山区",
            "石拐区",
            "九原区",
            "白云鄂博矿区",
            "土默特右旗",
            "固阳县",
            "达尔罕茂明安联合旗",
            "其他"
          ]
        },
  
        {
          name: "乌海",
          area: ["海勃湾区", "海南区", "乌达区", "其他"]
        },
  
        {
          name: "赤峰",
          area: [
            "红山区",
            "元宝山区",
            "松山区",
            "阿鲁科尔沁旗",
            "巴林左旗",
            "巴林右旗",
            "林西县",
            "克什克腾旗",
            "翁牛特旗",
            "喀喇沁旗",
            "宁城县",
            "敖汉旗",
            "其他"
          ]
        },
        {
          name: "通辽",
          area: [
            "科尔沁区",
            "霍林郭勒市",
            "科尔沁左翼中旗",
            "科尔沁左翼后旗",
            "开鲁县",
            "库伦旗",
            "奈曼旗",
            "扎鲁特旗",
            "其他"
          ]
        },
        {
          name: "鄂尔多斯",
          area: [
            "康巴什区",
            "东胜区",
            "准格尔旗",
            "达拉特旗",
            "鄂托克前旗",
            "鄂托克旗",
            "杭锦旗",
            "乌审旗",
            "伊金霍洛旗",
            "其他"
          ]
        },
        {
          name: "呼伦贝尔",
          area: [
            "海拉尔区",
            "满洲里市",
            "牙克石市",
            "扎兰屯市",
            "额尔古纳市",
            "根河市",
            "阿荣旗",
            "鄂伦春自治旗",
            "莫力达瓦达斡尔族自治旗",
            "鄂温克族自治旗",
            "陈巴尔虎旗",
            "新巴尔虎左旗",
            "新巴尔虎右旗",
            "其他"
          ]
        },
        {
          name: "巴彦淖尔盟",
          area: [
            "临河区",
            "五原县",
            "磴口县",
            "乌拉特前旗",
            "乌拉特中旗",
            "乌拉特后旗",
            "杭锦后旗",
            "其他"
          ]
        },
        {
          name: "乌兰察布",
          area: [
            "集宁市",
            "丰镇市",
            "卓资县",
            "化德县",
            "商都县",
            "兴和县",
            "凉城县",
            "察哈尔右翼前旗",
            "察哈尔右翼中旗",
            "察哈尔右翼后旗",
            "四子王旗",
            "其他"
          ]
        },
        {
          name: "兴安盟",
          area: [
            "乌兰浩特市",
            "阿尔山市",
            "科尔沁右翼前旗",
            "科尔沁右翼中旗",
            "扎赉特旗",
            "突泉县",
            "其他"
          ]
        },
        {
          name: "锡林郭勒盟",
          area: [
            "二连浩特市",
            "锡林浩特市",
            "阿巴嘎旗",
            "苏尼特左旗",
            "苏尼特右旗",
            "东乌珠穆沁旗",
            "西乌珠穆沁旗",
            "太仆寺旗",
            "镶黄旗",
            "正镶白旗",
            "正蓝旗",
            "多伦县",
            "其他"
          ]
        },
        {
          name: "阿拉善盟",
          area: ["阿拉善左旗", "阿拉善右旗", "额济纳旗", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    }, 
    {
      name: "辽宁",
      city: [
        {
          name: "沈阳",
          area: [
            "和平区",
            "沈河区",
            "大东区",
            "皇姑区",
            "铁西区",
            "浑南区",
            "于洪区",
            "辽中区",
            "苏家屯区",
            "沈北新区",
            "新民市",
            "康平县",
            "法库县",
            "其他"
          ]
        },
  
        {
          name: "大连",
          area: [
            "中山区",
            "西岗区",
            "金州区",
            "沙河口区",
            "甘井子区",
            "旅顺口区",
            "普兰店区",
            "庄河市",
            "瓦房店市",
            "长海县",
            "其他"
          ]
        },
        {
          name: "营口",
          area: [
            "站前区",
            "西市区",
            "老边区",
            "鲅鱼圈区",
            "盖州市",
            "大石桥市",
            "其他"
          ]
        },
        {
          name: "抚顺",
          area: [
            "顺城区",
            "新抚区",
            "东洲区",
            "望花区",
            "抚顺县",
            "清原满族自治县",
            "新宾满族自治县",
            "其他"
          ]
        },
        {
          name: "鞍山",
          area: [
            "铁东区",
            "铁西区",
            "立山区",
            "千山区",
            "海城市",
            "台安县",
            "岫岩满族自治县",
            "其他"
          ]
        },
        {
          name: "本溪",
          area: [
            "平山区",
            "明山区",
            "溪湖区",
            "南芬区",
            "本溪满族自治县",
            "桓仁满族自治县",
            "其他"
          ]
        },
        {
          name: "锦州",
          area: [
            "太和区",
            "古塔区",
            "凌河区",
            "凌海市",
            "北镇市",
            "黑山县",
            "义县",
            "其他"
          ]
        },
        {
          name: "丹东",
          area: [
            "振兴区",
            "元宝区",
            "振安区",
            "东港市",
            "凤城市",
            "宽甸满族自治县",
            "其他"
          ]
        },
  
        {
          name: "阜新",
          area: [
            "海州区",
            "新邱区",
            "太平区",
            "细河区",
            "清河门区",
            "彰武县",
            "阜新蒙古族自治县",
            "其他"
          ]
        },
  
        {
          name: "辽阳",
          area: [
            "白塔区",
            "文圣区",
            "宏伟区",
            "弓长岭区",
            "太子河区",
            "灯塔市",
            "辽阳县",
            "其他"
          ]
        },
  
        {
          name: "葫芦岛",
          area: [
            "连山区",
            "龙港区",
            "南票区",
            "兴城市",
            "绥中县",
            "建昌县",
            "其他"
          ]
        },
  
        {
          name: "盘锦",
          area: ["大洼区", "双台子区", "兴隆台区", "盘山县", "其他"]
        },
        {
          name: "朝阳",
          area: [
            "双塔区",
            "龙城区",
            "凌源市",
            "北票市",
            "朝阳县",
            "建平县",
            "喀喇沁左翼蒙古族自治县",
            "其他"
          ]
        },
        {
          name: "铁岭",
          area: [
            "银州区",
            "清河区",
            "调兵山市",
            "开原市",
            "铁岭县",
            "昌图县",
            "西丰县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "吉林",
      city: [
        {
          name: "长春",
          area: [
            "南关区",
            "宽城区",
            "朝阳区",
            "二道区",
            "绿园区",
            "双阳区",
            "九台区",
            "榆树市",
            "德惠市",
            "农安县",
            "其他"
          ]
        },
  
        {
          name: "吉林",
          area: [
            "昌邑区",
            "龙潭区",
            "船营区",
            "丰满区",
            "蛟河市",
            "桦甸市",
            "舒兰市",
            "磐石市",
            "永吉县",
            "其他"
          ]
        },
        {
          name: "通化",
          area: [
            "东昌区",
            "二道江区",
            "集安市",
            "梅河口市",
            "通化县",
            "辉南县",
            "柳河县",
            "其他"
          ]
        },
        {
          name: "四平",
          area: [
            "铁西区",
            "铁东区",
            "双辽市",
            "公主岭市",
            "梨树县",
            "伊通满族自治县",
            "其他"
          ]
        },
        {
          name: "白山",
          area: [
            "浑江区",
            "江源区",
            "临江市",
            "抚松县",
            "靖宇县",
            "长白朝鲜族自治县",
            "其他"
          ]
        },
  
        {
          name: "辽源",
          area: ["龙山区", "西安区", "东丰县", "东辽县", "其他"]
        },
        {
          name: "白城",
          area: ["洮北区", "洮南市", "大安市", "镇赉县", "通榆县", "其他"]
        },
  
        {
          name: "松原",
          area: [
            "宁江区",
            "扶余市",
            "长岭县",
            "乾安县",
            "前郭尔罗斯蒙古族自治县",
            "其他"
          ]
        },
  
        {
          name: "延边朝鲜族自治州",
          area: [
            "延吉市",
            "图们市",
            "敦化市",
            "珲春市",
            "龙井市",
            "和龙市",
            "汪清县",
            "安图县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "黑龙江",
      city: [
        {
          name: "哈尔滨",
          area: [
            "道里区",
            "南岗区",
            "道外区",
            "平房区",
            "松北区",
            "香坊区",
            "呼兰区",
            "阿城区",
            "双城区",
            "尚志市",
            "五常市",
            "宾县",
            "依兰县",
            "方正县",
            "巴彦县",
            "木兰县",
            "通河县",
            "延寿县",
            "其他"
          ]
        },
  
        {
          name: "齐齐哈尔",
          area: [
            "龙沙区",
            "建华区",
            "铁锋区",
            "昂昂溪区",
            "碾子山区",
            "富拉尔基区",
            "梅里斯达斡尔族区",
            "讷河市",
            "龙江县",
            "依安县",
            "泰来县",
            "甘南县",
            "富裕县",
            "克山县",
            "克东县",
            "拜泉县",
            "其他"
          ]
        },
  
        {
          name: "鹤岗",
          area: [
            "向阳区",
            "工农区",
            "南山区",
            "兴安区",
            "东山区",
            "兴山区",
            "萝北县",
            "绥滨县",
            "其他"
          ]
        },
  
        {
          name: "鸡西",
          area: [
            "鸡冠区",
            "恒山区",
            "滴道区",
            "梨树区",
            "麻山区",
            "城子河区",
            "虎林市",
            "密山市",
            "鸡东县",
            "其他"
          ]
        },
  
        {
          name: "大庆",
          area: [
            "龙凤区",
            "红岗区",
            "大同区",
            "萨尔图区",
            "让胡路区",
            "肇州县",
            "肇源县",
            "林甸县",
            "杜尔伯特蒙古族自治县",
            "其他"
          ]
        },
  
        {
          name: "伊春",
          area: [
            "伊美区",
            "友好区",
            "金林区",
            "乌翠区",
            "铁力市",
            "嘉荫县",
            "丰林县",
            "南岔县",
            "汤旺县",
            "大箐山县",
            "其他"
          ]
        },
  
        {
          name: "双鸭山",
          area: [
            "尖山区",
            "岭东区",
            "宝山区",
            "四方台区",
            "集贤县",
            "友谊县",
            "宝清县",
            "饶河县",
            "其他"
          ]
        },
  
        {
          name: "佳木斯",
          area: [
            "郊区",
            "向阳区",
            "前进区",
            "东风区",
            "同江市",
            "富锦市",
            "抚远市",
            "桦南县",
            "桦川县",
            "汤原县",
            "其他"
          ]
        },
  
        {
          name: "牡丹江",
          area: [
            "东安区",
            "阳明区",
            "爱民区",
            "西安区",
            "海林市",
            "宁安市",
            "穆棱市",
            "东宁市",
            "绥芬河市",
            "林口县",
            "其他"
          ]
        },
  
        {
          name: "七台河",
          area: ["新兴区", "桃山区", "茄子河区", "勃利县", "其他"]
        },
  
        {
          name: "绥化",
          area: [
            "北林区",
            "安达市",
            "肇东市",
            "海伦市",
            "望奎县",
            "兰西县",
            "青冈县",
            "庆安县",
            "明水县",
            "绥棱县",
            "其他"
          ]
        },
  
        {
          name: "黑河",
          area: [
            "爱辉区",
            "北安市",
            "嫩江市",
            "五大连池市",
            "逊克县",
            "孙吴县",
            "其他"
          ]
        },
  
        {
          name: "大兴安岭地区",
          area: ["漠河市", "呼玛县", "塔河县", "大兴安岭辖区", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "上海",
      city: [
        {
          name: "上海",
          area: [
            "黄浦区",
            "徐汇区",
            "长宁区",
            "静安区",
            "普陀区",
            "虹口区",
            "杨浦区",
            "闵行区",
            "宝山区",
            "嘉定区",
            "金山区",
            "松江区",
            "青浦区",
            "奉贤区",
            "崇明区",
            "浦东新区"
          ]
        }
      ]
    },
    {
      name: "江苏",
      city: [
        {
          name: "南京",
          area: [
            "鼓楼区",
            "玄武区",
            "秦淮区",
            "建邺区",
            "栖霞区",
            "雨花台区",
            "六合区",
            "浦口区",
            "江宁区",
            "溧水区",
            "高淳区",
            "其他"
          ]
        },
        {
          name: "无锡",
          area: [
            "梁溪区",
            "滨湖区",
            "新吴区",
            "锡山区",
            "惠山区",
            "江阴市",
            "宜兴市",
            "其他"
          ]
        },
  
        {
          name: "徐州",
          area: [
            "云龙区",
            "泉山区",
            "鼓楼区",
            "贾汪区",
            "铜山区",
            "邳州市",
            "新沂市",
            "丰县",
            "沛县",
            "睢宁县",
            "邳州市",
            "新沂市",
            "其他"
          ]
        },
  
        {
          name: "常州",
          area: [
            "新北区",
            "天宁区",
            "钟楼区",
            "金坛区",
            "武进区",
            "溧阳市",
            "其他"
          ]
        },
  
        {
          name: "苏州",
          area: [
            "姑苏区",
            "虎丘区",
            "相城区",
            "吴中区",
            "吴江区",
            "昆山市",
            "太仓市",
            "常熟市",
            "张家港市",
            "其他"
          ]
        },
  
        {
          name: "南通",
          area: [
            "崇川区",
            "港闸区",
            "通州区",
            "如皋市",
            "海门市",
            "海安市",
            "启东市",
            "如东县",
            "其他"
          ]
        },
  
        {
          name: "连云港",
          area: [
            "海州区",
            "连云区",
            "赣榆区",
            "东海县",
            "灌云县",
            "灌南县",
            "其他"
          ]
        },
  
        {
          name: "淮安",
          area: [
            "淮安区",
            "淮阴区",
            "洪泽区",
            "清江浦区",
            "涟水县",
            "盱眙县",
            "金湖县",
            "其他"
          ]
        },
        {
          name: "盐城",
          area: [
            "亭湖区",
            "盐都区",
            "大丰区",
            "东台市",
            "响水县",
            "射阳县",
            "滨海县",
            "阜宁县",
            "建湖县",
            "其他"
          ]
        },
        {
          name: "扬州",
          area: [
            "广陵区",
            "邗江区",
            "江都区",
            "仪征市",
            "高邮市",
            "宝应县",
            "其他"
          ]
        },
  
        {
          name: "镇江",
          area: [
            "京口区",
            "润州区",
            "丹徒区",
            "扬中市",
            "丹阳市",
            "扬中市",
            "句容市",
            "其他"
          ]
        },
  
        {
          name: "泰州",
          area: [
            "海陵区",
            "高港区",
            "姜堰区",
            "泰兴市",
            "靖江市",
            "兴化市",
            "其他"
          ]
        },
  
        {
          name: "宿迁",
          area: ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "浙江",
      city: [
        {
          name: "杭州",
          area: [
            "上城区",
            "下城区",
            "江干区",
            "拱墅区",
            "西湖区",
            "滨江区",
            "萧山区",
            "余杭区",
            "富阳区",
            "临安区",
            "建德市",
            "桐庐县",
            "淳安县",
            "其他"
          ]
        },
  
        {
          name: "宁波",
          area: [
            "海曙区",
            "江北区",
            "北仑区",
            "镇海区",
            "鄞州区",
            "奉化区",
            "余姚市",
            "慈溪市",
            "象山县",
            "宁海县",
            "其他"
          ]
        },
  
        {
          name: "温州",
          area: [
            "鹿城区",
            "龙湾区",
            "瓯海区",
            "洞头区",
            "瑞安市",
            "乐清市",
            "龙港市",
            "永嘉县",
            "平阳县",
            "苍南县",
            "文成县",
            "泰顺县",
            "其他"
          ]
        },
  
        {
          name: "绍兴",
          area: [
            "越城区",
            "柯桥区",
            "上虞区",
            "诸暨市",
            "嵊州市",
            "新昌县",
            "其他"
          ]
        },
  
        {
          name: "台州",
          area: [
            "椒江区",
            "黄岩区",
            "路桥区",
            "玉环市",
            "温岭市",
            "临海市",
            "三门县",
            "天台县",
            "仙居县",
            "其他"
          ]
        },
  
        {
          name: "金华",
          area: [
            "婺城区",
            "金东区",
            "义乌市",
            "东阳市",
            "兰溪市",
            "永康市",
            "武义县",
            "浦江县",
            "磐安县",
            "其他"
          ]
        },
  
        {
          name: "衢州",
          area: [
            "柯城区",
            "衢江区",
            "江山市",
            "常山县",
            "开化县",
            "龙游县",
            "其他"
          ]
        },
  
        {
          name: "湖州",
          area: ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县", "其他"]
        },
        {
          name: "嘉兴",
          area: [
            "南湖区",
            "秀洲区",
            "平湖市",
            "桐乡市",
            "海宁市",
            "嘉善县",
            "海盐县",
            "其他"
          ]
        },
  
        {
          name: "舟山",
          area: ["定海区", "普陀区", "岱山县", "嵊泗县", "其他"]
        },
  
        {
          name: "丽水",
          area: [
            "莲都区",
            "龙泉市",
            "青田县",
            "缙云县",
            "遂昌县",
            "松阳县",
            "云和县",
            "庆元县",
            "景宁畲族自治县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "安徽",
      city: [
        {
          name: "合肥",
          area: [
            "蜀山区",
            "瑶海区",
            "庐阳区",
            "包河区",
            "巢湖市",
            "长丰县",
            "肥东县",
            "肥西县",
            "庐江县",
            "其他"
          ]
        },
  
        {
          name: "淮南",
          area: [
            "大通区",
            "潘集区",
            "田家庵区",
            "谢家集区",
            "八公山区",
            "凤台县",
            "寿县",
            "其他"
          ]
        },
  
        {
          name: "芜湖",
          area: [
            "镜湖区",
            "弋江区",
            "鸠江区",
            "三山区",
            "无为市",
            "芜湖县",
            "南陵县",
            "繁昌县",
            "其他"
          ]
        },
  
        {
          name: "蚌埠",
          area: [
            "蚌山区",
            "禹会区",
            "淮上区",
            "龙子湖区",
            "怀远县",
            "固镇县",
            "五河县",
            "其他"
          ]
        },
  
        {
          name: "安庆",
          area: [
            "迎江区",
            "大观区",
            "宜秀区",
            "桐城市",
            "潜山市",
            "宿松县",
            "太湖县",
            "怀宁县",
            "岳西县",
            "望江县",
            "其他"
          ]
        },
  
        {
          name: "阜阳",
          area: [
            "颍州区",
            "颍东区",
            "颍泉区",
            "界首市",
            "临泉县",
            "颍上县",
            "太和县",
            "阜南县",
            "其他"
          ]
        },
  
        {
          name: "六安",
          area: [
            "金安区",
            "裕安区",
            "叶集区",
            "霍山县",
            "霍邱县",
            "舒城县",
            "金寨县",
            "其他"
          ]
        },
  
        {
          name: "黄山",
          area: [
            "屯溪区",
            "黄山区",
            "徽州区",
            "休宁县",
            "祁门县",
            "黟县",
            "歙县",
            "其他"
          ]
        },
  
        {
          name: "马鞍山",
          area: ["雨山区", "花山区", "博望区", "当涂县", "含山县", "和县", "其他"]
        },
  
        {
          name: "淮北",
          area: ["相山区", "杜集区", "烈山区", "濉溪县", "其他"]
        },
  
        {
          name: "铜陵",
          area: ["铜官区", "义安区", "郊区", "枞阳县", "其他"]
        },
  
        {
          name: "滁州",
          area: [
            "琅琊区",
            "南谯区",
            "天长市",
            "明光市",
            "全椒县",
            "来安县",
            "定远县",
            "凤阳县",
            "其他"
          ]
        },
        {
          name: "宣城",
          area: [
            "宣州区",
            "宁国市",
            "广德市",
            "郎溪县",
            "旌德县",
            "绩溪县",
            "泾县",
            "其他"
          ]
        },
  
        {
          name: "宿州",
          area: ["埇桥区", "灵璧县", "砀山县", "萧县", "泗县", "其他"]
        },
        {
          name: "亳州",
          area: ["谯城区", "利辛县", "涡阳县", "蒙城县", "其他"]
        },
        {
          name: "池州",
          area: ["贵池区", "石台县", "东至县", "青阳县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "福建",
      city: [
        {
          name: "福州",
          area: [
            "鼓楼区",
            "台江区",
            "仓山区",
            "马尾区",
            "长乐区",
            "晋安区",
            "福清市",
            "闽侯县",
            "闽清县",
            "连江县",
            "罗源县",
            "永泰县",
            "平潭县",
            "其他"
          ]
        },
  
        {
          name: "厦门",
          area: [
            "思明区",
            "海沧区",
            "湖里区",
            "集美区",
            "同安区",
            "翔安区",
            "其他"
          ]
        },
  
        {
          name: "泉州",
          area: [
            "丰泽区",
            "鲤城区",
            "洛江区",
            "泉港区",
            "石狮市",
            "晋江市",
            "南安市",
            "惠安县",
            "安溪县",
            "永春县",
            "德化县",
            "金门县",
            "其他"
          ]
        },
  
        {
          name: "莆田",
          area: ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县", "其他"]
        },
  
        {
          name: "三明",
          area: [
            "梅列区",
            "三元区",
            "永安市",
            "沙县",
            "明溪县",
            "清流县",
            "宁化县",
            "大田县",
            "尤溪县",
            "将乐县",
            "泰宁县",
            "建宁县",
            "其他"
          ]
        },
  
        {
          name: "漳州",
          area: [
            "芗城区",
            "龙文区",
            "龙海市",
            "云霄县",
            "漳浦县",
            "长泰县",
            "东山县",
            "南靖县",
            "平和县",
            "华安县",
            "诏安县",
            "其他"
          ]
        },
  
        {
          name: "南平",
          area: [
            "建阳区",
            "延平区",
            "邵武市",
            "建瓯市",
            "武夷山市",
            "顺昌县",
            "浦城县",
            "光泽县",
            "松溪县",
            "政和县",
            "其他"
          ]
        },
  
        {
          name: "龙岩",
          area: [
            "新罗区",
            "永定区",
            "漳平市",
            "长汀县",
            "上杭县",
            "武平县",
            "连城县",
            "其他"
          ]
        },
  
        {
          name: "宁德",
          area: [
            "蕉城区",
            "福安市",
            "福鼎市",
            "霞浦县",
            "古田县",
            "屏南县",
            "寿宁县",
            "周宁县",
            "柘荣县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "江西",
      city: [
        {
          name: "南昌",
          area: [
            "东湖区",
            "西湖区",
            "新建区",
            "青云谱区",
            "青山湖区",
            "红谷滩区",
            "南昌县",
            "进贤县",
            "安义县",
            "其他"
          ]
        },
  
        {
          name: "赣州",
          area: [
            "章贡区",
            "南康区",
            "赣县区",
            "瑞金市",
            "石城县",
            "安远县",
            "宁都县",
            "寻乌县",
            "兴国县",
            "定南县",
            "上犹县",
            "于都县",
            "龙南县",
            "崇义县",
            "信丰县",
            "全南县",
            "大余县",
            "会昌县",
            "其他"
          ]
        },
  
        {
          name: "上饶",
          area: [
            "信州区",
            "广丰区",
            "广信区",
            "德兴市",
            "上饶县",
            "鄱阳县",
            "婺源县",
            "铅山县",
            "余干县",
            "横峰县",
            "弋阳县",
            "玉山县",
            "万年县",
            "其他"
          ]
        },
  
        {
          name: "九江",
          area: [
            "浔阳区",
            "濂溪区",
            "柴桑区",
            "瑞昌市",
            "共青城市",
            "庐山市",
            "武宁县",
            "彭泽县",
            "永修县",
            "修水县",
            "湖口县",
            "德安县",
            "都昌县",
            "其他"
          ]
        },
  
        {
          name: "吉安",
          area: [
            "吉州区",
            "青原区",
            "井冈山市",
            "吉安县",
            "永丰县",
            "永新县",
            "新干县",
            "泰和县",
            "峡江县",
            "遂川县",
            "安福县",
            "吉水县",
            "万安县",
            "其他"
          ]
        },
  
        {
          name: "抚州",
          area: [
            "临川区",
            "东乡区",
            "南丰县",
            "乐安县",
            "金溪县",
            "南城县",
            "资溪县",
            "宜黄县",
            "广昌县",
            "黎川县",
            "崇仁县",
            "其他"
          ]
        },
  
        {
          name: "萍乡",
          area: ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县", "其他"]
        },
  
        {
          name: "景德镇",
          area: ["珠山区", "昌江区", "乐平市", "浮梁县", "其他"]
        },
  
        {
          name: "鹰潭",
          area: ["月湖区", "余江区", "贵溪市", "其他"]
        },
  
        {
          name: "宜春",
          area: [
            "袁州区",
            "丰城市",
            "樟树市",
            "高安市",
            "铜鼓县",
            "靖安县",
            "宜丰县",
            "奉新县",
            "万载县",
            "上高县",
            "其他"
          ]
        },
  
        {
          name: "新余",
          area: ["渝水区", "分宜县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "山东",
      city: [
        {
          name: "济南",
          area: [
            "历下区",
            "市中区",
            "天桥区",
            "历城区",
            "槐荫区",
            "长清区",
            "章丘区",
            "济阳区",
            "莱芜区",
            "钢城区",
            "平阴县",
            "商河县",
            "其他"
          ]
        },
  
        {
          name: "青岛",
          area: [
            "市南区",
            "市北区",
            "城阳区",
            "李沧区",
            "黄岛区",
            "崂山区",
            "即墨区",
            "胶州市",
            "平度市",
            "莱西市",
            "其他"
          ]
        },
  
        {
          name: "淄博",
          area: [
            "张店区",
            "临淄区",
            "博山区",
            "淄川区",
            "周村区",
            "桓台县",
            "高青县",
            "沂源县",
            "其他"
          ]
        },
  
        {
          name: "枣庄",
          area: [
            "薛城区",
            "峄城区",
            "山亭区",
            "市中区",
            "台儿庄区",
            "滕州市",
            "其他"
          ]
        },
  
        {
          name: "潍坊",
          area: [
            "潍城区",
            "寒亭区",
            "坊子区",
            "奎文区",
            "青州市",
            "诸城市",
            "寿光市",
            "安丘市",
            "高密市",
            "昌邑市",
            "昌乐县",
            "临朐县",
            "其他"
          ]
        },
  
        {
          name: "烟台",
          area: [
            "莱山区",
            "芝罘区",
            "福山区",
            "牟平区",
            "莱州市",
            "龙口市",
            "莱阳市",
            "招远市",
            "蓬莱市",
            "栖霞市",
            "海阳市",
            "长岛县",
            "其他"
          ]
        },
  
        {
          name: "临沂",
          area: [
            "兰山区",
            "罗庄区",
            "河东区",
            "费县",
            "沂南县",
            "沂水县",
            "郯城县",
            "兰陵县",
            "平邑县",
            "蒙阴县",
            "临沭县",
            "莒南县",
            "其他"
          ]
        },
  
        {
          name: "东营",
          area: ["东营区", "河口区", "垦利区", "广饶县", "利津县", "其他"]
        },
  
        {
          name: "德州",
          area: [
            "德城区",
            "陵城区",
            "乐陵市",
            "禹城市",
            "宁津县",
            "齐河县",
            "武城县",
            "平原县",
            "夏津县",
            "临邑县",
            "庆云县",
            "其他"
          ]
        },
  
        {
          name: "济宁",
          area: [
            "任城区",
            "兖州区",
            "曲阜市",
            "邹城市",
            "鱼台县",
            "金乡县",
            "嘉祥县",
            "微山县",
            "汶上县",
            "泗水县",
            "梁山县",
            "其他"
          ]
        },
  
        {
          name: "菏泽",
          area: [
            "牡丹区",
            "定陶区",
            "曹县",
            "单县",
            "成武县",
            "鄄城县",
            "郓城县",
            "巨野县",
            "东明县",
            "其他"
          ]
        },
  
        {
          name: "聊城",
          area: [
            "东昌府区",
            "茌平区",
            "临清市",
            "莘县",
            "冠县",
            "东阿县",
            "阳谷县",
            "高唐县",
            "其他"
          ]
        },
  
        {
          name: "滨州",
          area: [
            "滨城区",
            "沾化区",
            "邹平市",
            "惠民县",
            "博兴县",
            "阳信县",
            "无棣县",
            "其他"
          ]
        },
  
        {
          name: "泰安",
          area: [
            "泰山区",
            "岱岳区",
            "新泰市",
            "肥城市",
            "宁阳县",
            "东平县",
            "其他"
          ]
        },
  
        {
          name: "日照",
          area: ["东港区", "岚山区", "莒县", "五莲县", "其他"]
        },
  
        {
          name: "威海",
          area: ["环翠区", "文登区", "乳山市", "荣成市", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
    {
      name: "河南",
      city: [
        {
          name: "郑州",
          area: [
            "中原区",
            "二七区",
            "金水区",
            "管城回族区",
            "上街区",
            "惠济区",
            "巩义市",
            "新郑市",
            "新密市",
            "登封市",
            "荥阳市",
            "中牟县",
            "其他"
          ]
        },
  
        {
          name: "开封",
          area: [
            "龙亭区",
            "鼓楼区",
            "禹王台区",
            "顺河区",
            "祥符区",
            "兰考县",
            "通许县",
            "杞县",
            "尉氏县",
            "其他"
          ]
        },
  
        {
          name: "洛阳",
          area: [
            "涧西区",
            "西工区",
            "老城区",
            "瀍河区",
            "洛龙区",
            "吉利区",
            "偃师市",
            "宜阳县",
            "孟津县",
            "新安县",
            "洛宁县",
            "栾川县",
            "伊川县",
            "汝阳县",
            "嵩县",
            "其他"
          ]
        },
  
        {
          name: "平顶山",
          area: [
            "新华区",
            "卫东区",
            "石龙区",
            "湛河区",
            "汝州市",
            "舞钢市",
            "鲁山县",
            "宝丰县",
            "叶县",
            "郏县",
            "其他"
          ]
        },
  
        {
          name: "安阳",
          area: [
            "文峰区",
            "北关区",
            "殷都区",
            "龙安区",
            "林州市",
            "安阳县",
            "滑县",
            "汤阴县",
            "内黄县",
            "其他"
          ]
        },
  
        {
          name: "鹤壁",
          area: ["鹤山区", "山城区", "淇滨区", "浚县", "淇县", "其他"]
        },
  
        {
          name: "新乡",
          area: [
            "红旗区",
            "卫滨区",
            "牧野区",
            "凤泉区",
            "卫辉市",
            "辉县市",
            "新乡县",
            "获嘉县",
            "原阳县",
            "延津县",
            "封丘县",
            "长垣市",
            "其他"
          ]
        },
  
        {
          name: "焦作",
          area: [
            "山阳区",
            "中站区",
            "解放区",
            "马村区",
            "沁阳市",
            "孟州市",
            "修武县",
            "博爱县",
            "武陟县",
            "温县",
            "其他"
          ]
        },
  
        {
          name: "濮阳",
          area: ["华龙区", "濮阳县", "清丰县", "南乐县", "台前县", "范县", "其他"]
        },
  
        {
          name: "许昌",
          area: [
            "魏都区",
            "建安区",
            "禹州市",
            "长葛市",
            "鄢陵县",
            "襄城县",
            "其他"
          ]
        },
  
        {
          name: "漯河",
          area: ["郾城区", "源汇区", "召陵区", "舞阳县", "临颍县", "其他"]
        },
  
        {
          name: "三门峡",
          area: [
            "湖滨区",
            "陕州区",
            "灵宝市",
            "义马市",
            "渑池县",
            "卢氏县",
            "其他"
          ]
        },
  
        {
          name: "商丘",
          area: [
            "睢阳区",
            "梁园区",
            "永城市",
            "民权县",
            "宁陵县",
            "柘城县",
            "虞城县",
            "夏邑县",
            "睢县",
            "其他"
          ]
        },
  
        {
          name: "周口",
          area: [
            "川汇区",
            "项城市",
            "鹿邑县",
            "扶沟县",
            "西华县",
            "商水县",
            "沈丘县",
            "淮阳区",
            "郸城县",
            "太康县",
            "其他"
          ]
        },
  
        {
          name: "驻马店",
          area: [
            "驿城区",
            "新蔡县",
            "西平县",
            "遂平县",
            "平舆县",
            "上蔡县",
            "正阳县",
            "泌阳县",
            "确山县",
            "汝南县",
            "其他"
          ]
        },
  
        {
          name: "南阳",
          area: [
            "宛城区",
            "卧龙区",
            "邓州市",
            "南召县",
            "西峡县",
            "方城县",
            "镇平县",
            "内乡县",
            "淅川县",
            "社旗县",
            "唐河县",
            "新野县",
            "桐柏县",
            "其他"
          ]
        },
  
        {
          name: "信阳",
          area: [
            "浉河区",
            "平桥区",
            "固始县",
            "罗山县",
            "光山县",
            "潢川县",
            "淮滨县",
            "商城县",
            "新县",
            "息县",
            "其他"
          ]
        },
  
        {
          name: "济源",
          area: ["济源市", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "湖北",
      city: [
        {
          name: "武汉",
          area: [
            "江岸区",
            "江汉区",
            "汉阳区",
            "武昌区",
            "硚口区",
            "青山区",
            "洪山区",
            "汉南区",
            "蔡甸区",
            "江夏区",
            "黄陂区",
            "新洲区",
            "东西湖区",
            "其他"
          ]
        },
  
        {
          name: "黄石",
          area: [
            "下陆区",
            "铁山区",
            "黄石港区",
            "西塞山区",
            "大冶市",
            "阳新县",
            "其他"
          ]
        },
  
        {
          name: "十堰",
          area: [
            "茅箭区",
            "张湾区",
            "郧阳区",
            "丹江口市",
            "竹山县",
            "房县",
            "郧西县",
            "竹溪县",
            "其他"
          ]
        },
  
        {
          name: "荆州",
          area: [
            "沙市区",
            "荆州区",
            "洪湖市",
            "石首市",
            "松滋市",
            "监利县",
            "公安县",
            "江陵县",
            "其他"
          ]
        },
  
        {
          name: "宜昌",
          area: [
            "西陵区",
            "伍家岗区",
            "点军区",
            "猇亭区",
            "夷陵区",
            "宜都市",
            "当阳市",
            "枝江市",
            "秭归县",
            "远安县",
            "兴山县",
            "五峰土家族自治县",
            "长阳土家族自治县",
            "其他"
          ]
        },
  
        {
          name: "襄阳",
          area: [
            "襄城区",
            "樊城区",
            "襄州区",
            "老河口市",
            "枣阳市",
            "宜城市",
            "南漳县",
            "谷城县",
            "保康县",
            "其他"
          ]
        },
  
        {
          name: "鄂州",
          area: ["鄂城区", "华容区", "梁子湖区", "其他"]
        },
  
        {
          name: "荆门",
          area: ["东宝区", "掇刀区", "钟祥市", "京山市", "沙洋县", "其他"]
        },
  
        {
          name: "孝感",
          area: [
            "孝南区",
            "应城市",
            "安陆市",
            "汉川市",
            "云梦县",
            "大悟县",
            "孝昌县",
            "其他"
          ]
        },
  
        {
          name: "黄冈",
          area: [
            "黄州区",
            "麻城市",
            "武穴市",
            "红安县",
            "罗田县",
            "浠水县",
            "蕲春县",
            "黄梅县",
            "英山县",
            "团风县",
            "其他"
          ]
        },
  
        {
          name: "咸宁",
          area: [
            "咸安区",
            "赤壁市",
            "嘉鱼县",
            "通山县",
            "崇阳县",
            "通城县",
            "其他"
          ]
        },
  
        {
          name: "随州",
          area: ["曾都区", "广水市", "随县", "其他"]
        },
  
        {
          name: "恩施土家族苗族自治州",
          area: [
            "恩施市",
            "利川市",
            "建始县",
            "来凤县",
            "巴东县",
            "鹤峰县",
            "宣恩县",
            "咸丰县",
            "其他"
          ]
        },
  
        {
          name: "仙桃",
          area: ["仙桃", "其他"]
        },
  
        {
          name: "天门",
          area: ["天门", "其他"]
        },
  
        {
          name: "潜江",
          area: ["潜江", "其他"]
        },
  
        {
          name: "神农架林区",
          area: ["神农架林区", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "湖南",
      city: [
        {
          name: "长沙",
          area: [
            "芙蓉区",
            "天心区",
            "岳麓区",
            "开福区",
            "雨花区",
            "望城区",
            "宁乡市",
            "浏阳市",
            "长沙县",
            "其他"
          ]
        },
  
        {
          name: "株洲",
          area: [
            "天元区",
            "芦淞区",
            "荷塘区",
            "石峰区",
            "渌口区",
            "醴陵市",
            "攸县",
            "茶陵县",
            "炎陵县",
            "其他"
          ]
        },
  
        {
          name: "湘潭",
          area: ["岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县", "其他"]
        },
  
        {
          name: "衡阳",
          area: [
            "雁峰区",
            "石鼓区",
            "晖区",
            "蒸湘区",
            "南岳区",
            "耒阳市",
            "常宁市",
            "衡阳县",
            "衡南县",
            "衡山县",
            "衡东县",
            "祁东县",
            "其他"
          ]
        },
  
        {
          name: "邵阳",
          area: [
            "双清区",
            "大祥区",
            "北塔区",
            "武冈市",
            "邵东市",
            "新邵县",
            "邵阳县",
            "隆回县",
            "洞口县",
            "绥宁县",
            "新宁县",
            "城步苗族自治县",
            "其他"
          ]
        },
  
        {
          name: "岳阳",
          area: [
            "岳阳楼区",
            "云溪区",
            "君山区",
            "临湘市",
            "汨罗市",
            "岳阳县",
            "湘阴县",
            "平江县",
            "华容县",
            "其他"
          ]
        },
  
        {
          name: "常德",
          area: [
            "武陵区",
            "鼎城区",
            "津市市",
            "安乡县",
            "汉寿县",
            "桃源县",
            "临澧县",
            "石门县",
            "澧县",
            "其他"
          ]
        },
  
        {
          name: "张家界",
          area: ["永定区", "武陵源区", "慈利县", "桑植县", "其他"]
        },
  
        {
          name: "益阳",
          area: ["赫山区", "资阳区", "沅江市", "桃江县", "南县", "安化县", "其他"]
        },
  
        {
          name: "娄底",
          area: ["娄星区", "冷水江市", "涟源市", "新化县", "双峰县", "其他"]
        },
  
        {
          name: "郴州",
          area: [
            "北湖区",
            "苏仙区",
            "资兴市",
            "桂阳县",
            "宜章县",
            "永兴县",
            "嘉禾县",
            "临武县",
            "汝城县",
            "桂东县",
            "安仁县",
            "其他"
          ]
        },
  
        {
          name: "永州",
          area: [
            "零陵区",
            "冷水滩区",
            "双牌县",
            "祁阳县",
            "东安县",
            "道县",
            "宁远县",
            "新田县",
            "蓝山县",
            "江永县",
            "江华瑶族自治县",
            "其他"
          ]
        },
  
        {
          name: "怀化",
          area: [
            "鹤城区",
            "洪江市",
            "中方县",
            "沅陵县",
            "辰溪县",
            "溆浦县",
            "会同县",
            "麻阳苗族自治县",
            "新晃侗族自治县",
            "芷江侗族自治县",
            "靖州苗族侗族自治县",
            "通道侗族自治县",
            "洪江管理区",
            "其他"
          ]
        },
  
        {
          name: "湘西土家族苗族自治州",
          area: [
            "吉首市",
            "泸溪县",
            "凤凰县",
            "花垣县",
            "保靖县",
            "古丈县",
            "永顺县",
            "龙山县",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "广东",
      city: [
        {
          name: "广州",
          area: [
            "荔湾区",
            "越秀区",
            "海珠区",
            "天河区",
            "白云区",
            "黄埔区",
            "番禺区",
            "花都区",
            "南沙区",
            "从化区",
            "增城区",
            "其他"
          ]
        },
  
        {
          name: "韶关",
          area: [
            "武江区",
            "浈江区",
            "曲江区",
            "乐昌市",
            "南雄市",
            "始兴县",
            "仁化县",
            "翁源县",
            "乳源瑶族自治县",
            "新丰县",
            "其他"
          ]
        },
  
        {
          name: "深圳",
          area: [
            "罗湖区",
            "福田区",
            "南山区",
            "宝安区",
            "龙岗区",
            "盐田区",
            "龙华区",
            "坪山区",
            "光明区",
            "其他"
          ]
        },
  
        {
          name: "珠海",
          area: ["香洲区", "斗门区", "金湾区", "其他"]
        },
  
        {
          name: "汕头",
          area: [
            "金平区",
            "濠江区",
            "龙湖区",
            "潮阳区",
            "潮南区",
            "澄海区",
            "南澳县",
            "其他"
          ]
        },
  
        {
          name: "佛山",
          area: ["禅城区", "南海区", "顺德区", "三水区", "高明区", "其他"]
        },
  
        {
          name: "江门",
          area: [
            "蓬江区",
            "江海区",
            "新会区",
            "恩平市",
            "台山市",
            "开平市",
            "鹤山市",
            "其他"
          ]
        },
  
        {
          name: "湛江",
          area: [
            "赤坎区",
            "霞山区",
            "坡头区",
            "麻章区",
            "吴川市",
            "廉江市",
            "雷州市",
            "遂溪县",
            "徐闻县",
            "其他"
          ]
        },
  
        {
          name: "茂名",
          area: ["茂南区", "电白区", "高州市", "化州市", "信宜市", "其他"]
        },
  
        {
          name: "肇庆",
          area: [
            "端州区",
            "鼎湖区",
            "高要区",
            "四会市",
            "广宁县",
            "怀集县",
            "封开县",
            "德庆县",
            "其他"
          ]
        },
  
        {
          name: "惠州",
          area: ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县", "其他"]
        },
  
        {
          name: "梅州",
          area: [
            "梅江区",
            "梅县区",
            "兴宁市",
            "大埔县",
            "丰顺县",
            "五华县",
            "平远县",
            "蕉岭县",
            "其他"
          ]
        },
  
        {
          name: "汕尾",
          area: ["城区", "陆丰市", "海丰县", "陆河县", "其他"]
        },
  
        {
          name: "河源",
          area: [
            "源城区",
            "紫金县",
            "龙川县",
            "连平县",
            "和平县",
            "东源县",
            "其他"
          ]
        },
  
        {
          name: "阳江",
          area: ["江城区", "阳东区", "阳春市", "阳西县", "其他"]
        },
        {
          name: "清远",
          area: [
            "清城区",
            "清新区",
            "英德市",
            "连州市",
            "佛冈县",
            "阳山县",
            "连山壮族瑶族自治县",
            "连南瑶族自治县",
            "其他"
          ]
        },
        {
          name: "东莞",
          area: ["东莞", "其他"]
        },
  
        {
          name: "中山",
          area: ["中山", "其他"]
        },
  
        {
          name: "潮州",
          area: ["湘桥区", "潮安区", "饶平县", "其他"]
        },
  
        {
          name: "揭阳",
          area: ["榕城区", "揭东区", "普宁市", "揭西县", "惠来县", "其他"]
        },
  
        {
          name: "云浮",
          area: ["云城区", "云安区", "罗定市", "新兴县", "郁南县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "广西",
      city: [
        {
          name: "南宁",
          area: [
            "青秀区",
            "兴宁区",
            "西乡塘区",
            "江南区",
            "良庆区",
            "邕宁区",
            "武鸣区",
            "隆安县",
            "马山县",
            "上林县",
            "宾阳县",
            "横县",
            "其他"
          ]
        },
  
        {
          name: "柳州",
          area: [
            "柳北区",
            "柳南区",
            "柳江区",
            "城中区",
            "鱼峰区",
            "鹿寨县",
            "柳城县",
            "融安县",
            "融水苗族自治县",
            "三江侗族自治县",
            "其他"
          ]
        },
  
        {
          name: "桂林",
          area: [
            "象山区",
            "秀峰区",
            "叠彩区",
            "七星区",
            "雁山区",
            "临桂区",
            "荔浦市",
            "阳朔县",
            "灵川县",
            "全州县",
            "平乐县",
            "兴安县",
            "灌阳县",
            "资源县",
            "永福县",
            "龙胜各族自治县",
            "恭城瑶族自治县",
            "其他"
          ]
        },
  
        {
          name: "梧州",
          area: [
            "长洲区",
            "万秀区",
            "龙圩区",
            "岑溪市",
            "苍梧县",
            "蒙山县",
            "藤县",
            "其他"
          ]
        },
  
        {
          name: "北海",
          area: ["海城区", "银海区", "铁山港区", "合浦县", "其他"]
        },
  
        {
          name: "崇左",
          area: [
            "江州区",
            "凭祥市",
            "宁明县",
            "扶绥县",
            "龙州县",
            "大新县",
            "天等县",
            "其他"
          ]
        },
  
        {
          name: "来宾",
          area: [
            "兴宾区",
            "合山市",
            "象州县",
            "武宣县",
            "忻城县",
            "金秀瑶族自治县",
            "其他"
          ]
        },
  
        {
          name: "贺州",
          area: ["八步区", "平桂区", "昭平县", "钟山县", "富川瑶族自治县", "其他"]
        },
  
        {
          name: "玉林",
          area: [
            "玉州区",
            "福绵区",
            "北流市",
            "容县",
            "陆川县",
            "博白县",
            "兴业县",
            "其他"
          ]
        },
  
        {
          name: "百色",
          area: [
            "右江区",
            "田阳区",
            "平果市",
            "靖西市",
            "田东县",
            "德保县",
            "那坡县",
            "凌云县",
            "乐业县",
            "田林县",
            "西林县",
            "隆林各族自治县",
            "其他"
          ]
        },
  
        {
          name: "河池",
          area: [
            "宜州区",
            "金城江区",
            "南丹县",
            "天峨县",
            "凤山县",
            "东兰县",
            "巴马瑶族自治县",
            "都安瑶族自治县",
            "大化瑶族自治县",
            "罗城仫佬族自治县",
            "环江毛南族自治县",
            "其他"
          ]
        },
  
        {
          name: "钦州",
          area: ["钦南区", "钦北区", "灵山县", "浦北县", "其他"]
        },
  
        {
          name: "防城港",
          area: ["港口区", "防城区", "东兴市", "上思县", "其他"]
        },
  
        {
          name: "贵港",
          area: ["港北区", "港南区", "覃塘区", "桂平市", "平南县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "海南",
      city: [
        {
          name: "海口",
          area: ["龙华区", "秀英区", "琼山区", "美兰区", "其他"]
        },
  
        {
          name: "三亚",
          area: ["崖州区", "天涯区", "吉阳区", "海棠区", "其他"]
        },
  
        {
          name: "五指山",
          area: ["五指山", "其他"]
        },
  
        {
          name: "琼海",
          area: ["琼海", "其他"]
        },
  
        {
          name: "儋州",
          area: ["儋州", "其他"]
        },
  
        {
          name: "文昌",
          area: ["文昌", "其他"]
        },
  
        {
          name: "万宁",
          area: ["万宁", "其他"]
        },
  
        {
          name: "东方",
          area: ["东方", "其他"]
        },
  
        {
          name: "澄迈县",
          area: ["澄迈县", "其他"]
        },
  
        {
          name: "定安县",
          area: ["定安县", "其他"]
        },
  
        {
          name: "屯昌县",
          area: ["屯昌县", "其他"]
        },
  
        {
          name: "临高县",
          area: ["临高县", "其他"]
        },
  
        {
          name: "白沙黎族自治县",
          area: ["白沙黎族自治县", "其他"]
        },
  
        {
          name: "昌江黎族自治县",
          area: ["昌江黎族自治县", "其他"]
        },
  
        {
          name: "乐东黎族自治县",
          area: ["乐东黎族自治县", "其他"]
        },
  
        {
          name: "陵水黎族自治县",
          area: ["陵水黎族自治县", "其他"]
        },
  
        {
          name: "保亭黎族苗族自治县",
          area: ["保亭黎族苗族自治县", "其他"]
        },
  
        {
          name: "琼中黎族苗族自治县",
          area: ["琼中黎族苗族自治县", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "重庆",
      city: [
        {
          name: "重庆",
          area: [
            "渝中区",
            "万州区",
            "涪陵区",
            "大渡口区",
            "江北区",
            "沙坪坝区",
            "九龙坡区",
            "南岸区",
            "北碚区",
            "綦江区",
            "大足区",
            "渝北区",
            "巴南区",
            "黔江区",
            "长寿区",
            "江津区",
            "合川区",
            "永川区",
            "南川区",
            "璧山区",
            "铜梁区",
            "潼南区",
            "荣昌区",
            "开州区",
            "梁平区",
            "武隆区",
            "城口县",
            "丰都县",
            "垫江县",
            "忠县",
            "云阳县",
            "奉节县",
            "巫山县",
            "巫溪县",
            "石柱土家族自治县",
            "秀山土家族苗族自治县",
            "酉阳土家族苗族自治县",
            "彭水苗族土家族自治县",
            "其他"
          ]
        }
      ]
    },
  
    {
      name: "四川",
      city: [
        {
          name: "成都",
          area: [
            "锦江区",
            "青羊区",
            "金牛区",
            "武侯区",
            "成华区",
            "青白江区",
            "龙泉驿区",
            "新都区",
            "温江区",
            "双流区",
            "郫都区",
            "都江堰市",
            "彭州市",
            "崇州市",
            "邛崃市",
            "简阳市",
            "金堂县",
            "大邑县",
            "蒲江县",
            "新津县",
            "其他"
          ]
        },
  
        {
          name: "绵阳",
          area: [
            "涪城区",
            "游仙区",
            "安州区",
            "江油市",
            "梓潼县",
            "三台县",
            "盐亭县",
            "平武县",
            "北川羌族自治县",
            "其他"
          ]
        },
  
        {
          name: "自贡",
          area: [
            "大安区",
            "自流井区",
            "贡井区",
            "沿滩区",
            "荣县",
            "富顺县",
            "其他"
          ]
        },
  
        {
          name: "攀枝花",
          area: ["东区", "西区", "仁和区", "米易县", "盐边县", "其他"]
        },
  
        {
          name: "泸州",
          area: [
            "江阳区",
            "纳溪区",
            "龙马潭区",
            "泸县",
            "合江县",
            "叙永县",
            "古蔺县",
            "其他"
          ]
        },
  
        {
          name: "德阳",
          area: [
            "旌阳区",
            "罗江区",
            "广汉市",
            "什邡市",
            "绵竹市",
            "中江县",
            "其他"
          ]
        },
  
        {
          name: "广元",
          area: [
            "利州区",
            "昭化区",
            "朝天区",
            "旺苍县",
            "青川县",
            "剑阁县",
            "苍溪县",
            "其他"
          ]
        },
  
        {
          name: "遂宁",
          area: ["船山区", "安居区", "射洪市", "蓬溪县", "大英县", "其他"]
        },
  
        {
          name: "内江",
          area: ["市中区", "东兴区", "隆昌市", "资中县", "威远县", "其他"]
        },
  
        {
          name: "乐山",
          area: [
            "市中区",
            "沙湾区",
            "五通桥区",
            "金口河区",
            "峨眉山市",
            "犍为县",
            "井研县",
            "夹江县",
            "沐川县",
            "峨边彝族自治县",
            "马边彝族自治县",
            "其他"
          ]
        },
  
        {
          name: "资阳",
          area: ["雁江区", "安岳县", "乐至县", "其他"]
        },
  
        {
          name: "宜宾",
          area: [
            "叙州区",
            "翠屏区",
            "南溪区",
            "江安县",
            "长宁县",
            "高县",
            "筠连县",
            "珙县",
            "兴文县",
            "屏山县",
            "其他"
          ]
        },
  
        {
          name: "南充",
          area: [
            "顺庆区",
            "高坪区",
            "嘉陵区",
            "阆中市",
            "营山县",
            "蓬安县",
            "仪陇县",
            "南部县",
            "西充县",
            "其他"
          ]
        },
  
        {
          name: "达州",
          area: [
            "通川区",
            "达川区",
            "万源市",
            "渠县",
            "大竹县",
            "宣汉县",
            "开江县",
            "其他"
          ]
        },
  
        {
          name: "雅安",
          area: [
            "雨城区",
            "名山区",
            "荥经县",
            "汉源县",
            "石棉县",
            "天全县",
            "芦山县",
            "宝兴县",
            "其他"
          ]
        },
  
        {
          name: "眉山",
          area: [
            "东坡区",
            "彭山区",
            "仁寿县",
            "丹棱县",
            "青神县",
            "洪雅县",
            "其他"
          ]
        },
  
        {
          name: "广安",
          area: [
            "广安区",
            "前锋区",
            "华蓥市",
            "岳池县",
            "武胜县",
            "邻水县",
            "其他"
          ]
        },
  
        {
          name: "巴中",
          area: ["巴州区", "恩阳区", "平昌县", "通江县", "南江县", "其他"]
        },
  
        {
          name: "阿坝藏族羌族自治州",
          area: [
            "马尔康市",
            "金川县",
            "小金县",
            "阿坝县",
            "若尔盖县",
            "红原县",
            "壤塘县",
            "汶川县",
            "理县",
            "茂县",
            "松潘县",
            "九寨沟县",
            "黑水县",
            "其他"
          ]
        },
  
        {
          name: "甘孜藏族自治州",
          area: [
            "康定市",
            "泸定县",
            "丹巴县",
            "九龙县",
            "雅江县",
            "道孚县",
            "炉霍县",
            "甘孜县",
            "新龙县",
            "德格县",
            "白玉县",
            "石渠县",
            "色达县",
            "理塘县",
            "巴塘县",
            "乡城县",
            "稻城县",
            "得荣县",
            "其他"
          ]
        },
  
        {
          name: "凉山彝族自治州",
          area: [
            "西昌市",
            "德昌县",
            "会理县",
            "会东县",
            "宁南县",
            "普格县",
            "布拖县",
            "昭觉县",
            "金阳县",
            "雷波县",
            "美姑县",
            "甘洛县",
            "越西县",
            "喜德县",
            "冕宁县",
            "盐源县",
            "木里藏族自治县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "贵州",
      city: [
        {
          name: "贵阳",
          area: [
            "观山湖区",
            "南明区",
            "云岩区",
            "花溪区",
            "乌当区",
            "白云区",
            "清镇市",
            "开阳县",
            "息烽县",
            "修文县",
            "其他"
          ]
        },
  
        {
          name: "遵义",
          area: [
            "汇川区",
            "播州区",
            "红花岗区",
            "赤水市",
            "仁怀市",
            "桐梓县",
            "绥阳县",
            "正安县",
            "凤冈县",
            "湄潭县",
            "余庆县",
            "习水县",
            "道真仡佬族苗族自治县",
            "务川仡佬族苗族自治县",
            "其他"
          ]
        },
  
        {
          name: "六盘水",
          area: ["钟山区", "盘州市", "水城县", "六枝特区", "其他"]
        },
  
        {
          name: "安顺",
          area: [
            "西秀区",
            "平坝区",
            "普定县",
            "镇宁布依族苗族自治县",
            "关岭布依族苗族自治县",
            "紫云苗族布依族自治县",
            "其他"
          ]
        },
  
        {
          name: "铜仁",
          area: [
            "碧江区",
            "万山区",
            "江口县",
            "石阡县",
            "思南县",
            "德江县",
            "松桃苗族自治县",
            "玉屏侗族自治县",
            "沿河土家族自治县",
            "印江土家族苗族自治县",
            "其他"
          ]
        },
  
        {
          name: "毕节",
          area: [
            "七星关区",
            "大方县",
            "黔西县",
            "金沙县",
            "织金县",
            "纳雍县",
            "赫章县",
            "威宁彝族回族苗族自治县",
            "其他"
          ]
        },
  
        {
          name: "黔西南布依族苗族自治州",
          area: [
            "兴义市",
            "兴仁市",
            "普安县",
            "晴隆县",
            "贞丰县",
            "望谟县",
            "册亨县",
            "安龙县",
            "其他"
          ]
        },
  
        {
          name: "黔东南苗族侗族自治州",
          area: [
            "凯里市",
            "黄平县",
            "施秉县",
            "三穗县",
            "镇远县",
            "岑巩县",
            "天柱县",
            "锦屏县",
            "剑河县",
            "台江县",
            "黎平县",
            "榕江县",
            "从江县",
            "雷山县",
            "麻江县",
            "丹寨县",
            "其他"
          ]
        },
  
        {
          name: "黔南布依族苗族自治州",
          area: [
            "都匀市",
            "福泉市",
            "荔波县",
            "贵定县",
            "瓮安县",
            "独山县",
            "平塘县",
            "罗甸县",
            "长顺县",
            "龙里县",
            "惠水县",
            "三都水族自治县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "云南",
      city: [
        {
          name: "昆明",
          area: [
            "呈贡区",
            "盘龙区",
            "五华区",
            "官渡区",
            "西山区",
            "晋宁区",
            "东川区",
            "安宁市",
            "富民县",
            "宜良县",
            "嵩明县",
            "石林彝族自治县",
            "禄劝彝族苗族自治县",
            "寻甸回族彝族自治县",
            "其他"
          ]
        },
  
        {
          name: "曲靖",
          area: [
            "麒麟区",
            "沾益区",
            "马龙区",
            "宣威市",
            "富源县",
            "罗平县",
            "师宗县",
            "陆良县",
            "会泽县",
            "其他"
          ]
        },
  
        {
          name: "玉溪",
          area: [
            "红塔区",
            "江川区",
            "澄江市",
            "通海县",
            "华宁县",
            "易门县",
            "峨山彝族自治县",
            "新平彝族傣族自治县",
            "元江哈尼族彝族傣族自治县",
            "其他"
          ]
        },
  
        {
          name: "昭通",
          area: [
            "昭阳区",
            "水富市",
            "鲁甸县",
            "巧家县",
            "盐津县",
            "大关县",
            "永善县",
            "绥江县",
            "镇雄县",
            "彝良县",
            "威信县",
            "其他"
          ]
        },
  
        {
          name: "保山",
          area: ["隆阳区", "腾冲市", "施甸县", "龙陵县", "昌宁县", "其他"]
        },
  
        {
          name: "丽江",
          area: [
            "古城区",
            "永胜县",
            "华坪县",
            "玉龙纳西族自治县",
            "宁蒗彝族自治县",
            "其他"
          ]
        },
  
        {
          name: "普洱",
          area: [
            "思茅区",
            "宁洱哈尼族彝族自治县",
            "墨江哈尼族自治县",
            "景东彝族自治县",
            "景谷傣族彝族自治县",
            "镇沅彝族哈尼族拉祜族自治县",
            "江城哈尼族彝族自治县",
            "孟连傣族拉祜族佤族自治县",
            "澜沧拉祜族自治县",
            "西盟佤族自治县",
            "其他"
          ]
        },
  
        {
          name: "临沧",
          area: [
            "临翔区",
            "凤庆县",
            "云县",
            "永德县",
            "镇康县",
            "双江拉祜族佤族布朗族傣族自治县",
            "耿马傣族佤族自治县",
            "沧源佤族自治县",
            "其他"
          ]
        },
  
        {
          name: "德宏傣族景颇族自治州",
          area: ["芒市", "瑞丽市", "梁河县", "盈江县", "陇川县", "其他"]
        },
  
        {
          name: "怒江傈僳族自治州",
          area: [
            "泸水市",
            "福贡县",
            "贡山独龙族怒族自治县",
            "兰坪白族普米族自治县",
            "其他"
          ]
        },
  
        {
          name: "迪庆藏族自治州",
          area: ["香格里拉市", "德钦县", "维西傈僳族自治县", "其他"]
        },
  
        {
          name: "大理白族自治州",
          area: [
            "大理市",
            "祥云县",
            "宾川县",
            "弥渡县",
            "永平县",
            "云龙县",
            "洱源县",
            "剑川县",
            "鹤庆县",
            "漾濞彝族自治县",
            "南涧彝族自治县",
            "巍山彝族回族自治县",
            "其他"
          ]
        },
  
        {
          name: "楚雄彝族自治州",
          area: [
            "楚雄市",
            "双柏县",
            "牟定县",
            "南华县",
            "姚安县",
            "大姚县",
            "永仁县",
            "元谋县",
            "武定县",
            "禄丰县",
            "其他"
          ]
        },
  
        {
          name: "红河哈尼族彝族自治州",
          area: [
            "蒙自市",
            "个旧市",
            "开远市",
            "弥勒市",
            "建水县",
            "石屏县",
            "泸西县",
            "绿春县",
            "元阳县",
            "红河县",
            "金平苗族瑶族傣族自治县",
            "河口瑶族自治县",
            "屏边苗族自治县",
            "其他"
          ]
        },
  
        {
          name: "文山壮族苗族自治州",
          area: [
            "文山市",
            "砚山县",
            "西畴县",
            "麻栗坡县",
            "马关县",
            "丘北县",
            "广南县",
            "富宁县",
            "其他"
          ]
        },
  
        {
          name: "西双版纳傣族自治州",
          area: ["景洪市", "勐海县", "勐腊县", "其他"]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "西藏",
      city: [
        {
          name: "拉萨",
          area: [
            "城关区",
            "堆龙德庆区",
            "达孜区",
            "林周县",
            "尼木县",
            "当雄县",
            "曲水县",
            "墨竹工卡县",
            "其他"
          ]
        },
  
        {
          name: "日喀则",
          area: [
            "桑珠孜区",
            "南木林县",
            "江孜县",
            "定日县",
            "萨迦县",
            "拉孜县",
            "昂仁县",
            "谢通门县",
            "白朗县",
            "仁布县",
            "康马县",
            "定结县",
            "仲巴县",
            "亚东县",
            "吉隆县",
            "聂拉木县",
            "萨嘎县",
            "岗巴县",
            "其他"
          ]
        },
  
        {
          name: "昌都",
          area: [
            "卡若区",
            "察雅县",
            "左贡县",
            "芒康县",
            "洛隆县",
            "边坝县",
            "江达县",
            "贡觉县",
            "丁青县",
            "八宿县",
            "类乌齐县",
            "其他"
          ]
        },
  
        {
          name: "林芝",
          area: [
            "巴宜区",
            "米林县",
            "墨脱县",
            "察隅县",
            "波密县",
            "朗县",
            "工布江达县",
            "其他"
          ]
        },
  
        {
          name: "山南",
          area: [
            "乃东区",
            "扎囊县",
            "贡嘎县",
            "桑日县",
            "琼结县",
            "洛扎县",
            "加查县",
            "隆子县",
            "曲松县",
            "措美县",
            "错那县",
            "浪卡子县",
            "其他"
          ]
        },
  
        {
          name: "那曲",
          area: [
            "色尼区",
            "申扎县",
            "班戈县",
            "聂荣县",
            "安多县",
            "嘉黎县",
            "巴青县",
            "比如县",
            "索县",
            "尼玛县",
            "双湖县",
            "其他"
          ]
        },
  
        {
          name: "阿里地区",
          area: [
            "噶尔县",
            "普兰县",
            "札达县",
            "日土县",
            "革吉县",
            "改则县",
            "措勤县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "陕西",
      city: [
        {
          name: "西安",
          area: [
            "新城区",
            "碑林区",
            "莲湖区",
            "灞桥区",
            "未央区",
            "雁塔区",
            "阎良区",
            "临潼区",
            "长安区",
            "高陵区",
            "鄠邑区",
            "蓝田县",
            "周至县",
            "其他"
          ]
        },
  
        {
          name: "铜川",
          area: ["耀州区", "王益区", "印台区", "宜君县", "其他"]
        },
  
        {
          name: "宝鸡",
          area: [
            "渭滨区",
            "金台区",
            "陈仓区",
            "岐山县",
            "凤翔县",
            "陇县",
            "太白县",
            "麟游县",
            "扶风县",
            "千阳县",
            "眉县",
            "凤县",
            "其他"
          ]
        },
  
        {
          name: "咸阳",
          area: [
            "秦都区",
            "渭城区",
            "杨陵区",
            "兴平市",
            "彬州市",
            "三原县",
            "泾阳县",
            "乾县",
            "礼泉县",
            "永寿县",
            "长武县",
            "旬邑县",
            "淳化县",
            "武功县",
            "其他"
          ]
        },
  
        {
          name: "渭南",
          area: [
            "临渭区",
            "华州区",
            "韩城市",
            "华阴市",
            "蒲城县",
            "潼关县",
            "白水县",
            "澄城县",
            "合阳县",
            "富平县",
            "大荔县",
            "其他"
          ]
        },
  
        {
          name: "延安",
          area: [
            "宝塔区",
            "安塞区",
            "子长市",
            "洛川县",
            "黄陵县",
            "延川县",
            "富县",
            "延长县",
            "甘泉县",
            "宜川县",
            "志丹县",
            "黄龙县",
            "吴起县",
            "其他"
          ]
        },
  
        {
          name: "汉中",
          area: [
            "汉台区",
            "南郑区",
            "留坝县",
            "镇巴县",
            "城固县",
            "洋县",
            "宁强县",
            "佛坪县",
            "勉县",
            "西乡县",
            "略阳县",
            "其他"
          ]
        },
  
        {
          name: "榆林",
          area: [
            "榆阳区",
            "横山区",
            "神木市",
            "清涧县",
            "绥德县",
            "佳县",
            "府谷县",
            "子洲县",
            "靖边县",
            "米脂县",
            "吴堡县",
            "定边县",
            "其他"
          ]
        },
  
        {
          name: "安康",
          area: [
            "汉滨区",
            "紫阳县",
            "岚皋县",
            "旬阳县",
            "镇坪县",
            "平利县",
            "石泉县",
            "宁陕县",
            "白河县",
            "汉阴县",
            "其他"
          ]
        },
  
        {
          name: "商洛",
          area: [
            "商州区",
            "镇安县",
            "山阳县",
            "洛南县",
            "商南县",
            "丹凤县",
            "柞水县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "甘肃",
      city: [
        {
          name: "兰州",
          area: [
            "城关区",
            "七里河区",
            "西固区",
            "安宁区",
            "红古区",
            "永登县",
            "皋兰县",
            "榆中县",
            "其他"
          ]
        },
  
        {
          name: "嘉峪关",
          area: ["嘉峪关市", "其他"]
        },
  
        {
          name: "金昌",
          area: ["金川区", "永昌县", "其他"]
        },
  
        {
          name: "白银",
          area: ["白银区", "平川区", "靖远县", "会宁县", "景泰县", "其他"]
        },
  
        {
          name: "天水",
          area: [
            "秦州区",
            "麦积区",
            "甘谷县",
            "武山县",
            "秦安县",
            "清水县",
            "张家川回族自治县",
            "其他"
          ]
        },
  
        {
          name: "武威",
          area: ["凉州区", "民勤县", "古浪县", "天祝藏族自治县", "其他"]
        },
  
        {
          name: "酒泉",
          area: [
            "肃州区",
            "玉门市",
            "敦煌市",
            "金塔县",
            "瓜州县",
            "肃北县",
            "阿克塞哈萨克族自治县",
            "其他"
          ]
        },
  
        {
          name: "张掖",
          area: [
            "甘州区",
            "民乐县",
            "临泽县",
            "高台县",
            "山丹县",
            "肃南裕固族自治县",
            "其他"
          ]
        },
  
        {
          name: "庆阳",
          area: [
            "西峰区",
            "庆城县",
            "环县",
            "华池县",
            "合水县",
            "正宁县",
            "宁县",
            "镇原县",
            "其他"
          ]
        },
  
        {
          name: "平凉",
          area: [
            "崆峒区",
            "华亭市",
            "泾川县",
            "灵台县",
            "崇信县",
            "庄浪县",
            "静宁县",
            "其他"
          ]
        },
  
        {
          name: "定西",
          area: [
            "安定区",
            "通渭县",
            "临洮县",
            "漳县",
            "岷县",
            "渭源县",
            "陇西县",
            "其他"
          ]
        },
  
        {
          name: "陇南",
          area: [
            "武都区",
            "成县",
            "宕昌县",
            "康县",
            "文县",
            "西和县",
            "礼县",
            "两当县",
            "徽县",
            "其他"
          ]
        },
  
        {
          name: "临夏回族自治州",
          area: [
            "临夏市",
            "临夏县",
            "康乐县",
            "永靖县",
            "广河县",
            "和政县",
            "东乡族自治县",
            "积石山保安族东乡族撒拉族自治县",
            "其他"
          ]
        },
  
        {
          name: "甘南藏族自治州",
          area: [
            "合作市",
            "临潭县",
            "卓尼县",
            "舟曲县",
            "迭部县",
            "玛曲县",
            "碌曲县",
            "夏河县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "青海",
      city: [
        {
          name: "西宁",
          area: [
            "城中区",
            "城东区",
            "城西区",
            "城北区",
            "湟中区",
            "湟源县",
            "大通回族土族自治县",
            "其他"
          ]
        },
  
        {
          name: "海东",
          area: [
            "乐都区",
            "平安区",
            "民和回族土族自治县",
            "互助土族自治县",
            "化隆回族自治县",
            "循化撒拉族自治县",
            "其他"
          ]
        },
  
        {
          name: "海北藏族自治州",
          area: ["海晏县", "祁连县", "刚察县", "门源回族自治县", "其他"]
        },
  
        {
          name: "海南藏族自治州",
          area: ["共和县", "同德县", "贵德县", "兴海县", "贵南县", "其他"]
        },
  
        {
          name: "黄南藏族自治州",
          area: ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县", "其他"]
        },
  
        {
          name: "果洛藏族自治州",
          area: [
            "玛沁县",
            "班玛县",
            "甘德县",
            "达日县",
            "久治县",
            "玛多县",
            "其他"
          ]
        },
  
        {
          name: "玉树藏族自治州",
          area: [
            "玉树市",
            "杂多县",
            "称多县",
            "治多县",
            "囊谦县",
            "曲麻莱县",
            "其他"
          ]
        },
  
        {
          name: "海西蒙古族藏族自治州",
          area: [
            "德令哈市",
            "格尔木市",
            "茫崖市",
            "天峻县",
            "都兰县",
            "乌兰县",
            "其他"
          ]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "宁夏",
      city: [
        {
          name: "银川",
          area: [
            "兴庆区",
            "西夏区",
            "金凤区",
            "灵武市",
            "永宁县",
            "贺兰县",
            "其他"
          ]
        },
  
        {
          name: "石嘴山",
          area: ["大武口区", "惠农区", "平罗县", "其他"]
        },
  
        {
          name: "吴忠",
          area: ["利通区", "红寺堡区", "青铜峡市", "同心县", "盐池县", "其他"]
        },
  
        {
          name: "固原",
          area: ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县", "其他"]
        },
  
        {
          name: "中卫",
          area: ["沙坡头区", "中宁县", "海原县", "其他"]
        },
  
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "新疆",
      city: [
        {
          name: "乌鲁木齐",
          area: [
            "水磨沟区",
            "天山区",
            "沙依巴克区",
            "新市区",
            "头屯河区",
            "达坂城区",
            "米东区",
            "乌鲁木齐县",
            "其他"
          ]
        },
  
        {
          name: "克拉玛依",
          area: ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区", "其他"]
        },
  
        {
          name: "吐鲁番",
          area: ["高昌区", "鄯善县", "托克逊县", "其他"]
        },
  
        {
          name: "哈密",
          area: ["伊州区", "伊吾县", "巴里坤哈萨克自治县", "其他"]
        },
  
        {
          name: "阿克苏地区",
          area: [
            "阿克苏市",
            "库车市",
            "温宿县",
            "沙雅县",
            "新和县",
            "拜城县",
            "乌什县",
            "阿瓦提县",
            "柯坪县",
            "其他"
          ]
        },
  
        {
          name: "喀什地区",
          area: [
            "喀什市",
            "疏附县",
            "疏勒县",
            "英吉沙县",
            "泽普县",
            "莎车县",
            "叶城县",
            "麦盖提县",
            "岳普湖县",
            "伽师县",
            "巴楚县",
            "塔什库尔干塔吉克自治县",
            "其他"
          ]
        },
  
        {
          name: "和田地区",
          area: [
            "和田市",
            "和田县",
            "墨玉县",
            "皮山县",
            "洛浦县",
            "策勒县",
            "于田县",
            "民丰县",
            "其他"
          ]
        },
  
        {
          name: "昌吉回族自治州",
          area: [
            "昌吉市",
            "阜康市",
            "奇台县",
            "玛纳斯县",
            "吉木萨尔县",
            "呼图壁县",
            "木垒哈萨克自治县",
            "其他"
          ]
        },
  
        {
          name: "博尔塔拉蒙古自治州",
          area: ["博乐市", "阿拉山口市", "精河县", "温泉县", "其他"]
        },
  
        {
          name: "巴音郭楞蒙古自治州",
          area: [
            "库尔勒市",
            "和静县",
            "尉犁县",
            "和硕县",
            "且末县",
            "博湖县",
            "轮台县",
            "若羌县",
            "焉耆回族自治县",
            "其他"
          ]
        },
  
        {
          name: "克孜勒苏柯尔克孜自治州",
          area: ["阿图什市", "阿合奇县", "乌恰县", "阿克陶县", "其他"]
        },
  
        {
          name: "伊犁哈萨克自治州",
          area: [
            "伊宁市",
            "奎屯市",
            "霍尔果斯市",
            "尼勒克县",
            "伊宁县",
            "霍城县",
            "巩留县",
            "新源县",
            "昭苏县",
            "特克斯县",
            "察布查尔锡伯自治县",
            "其他"
          ]
        },
        {
          name: "塔城地区",
          area: [
            "塔城市",
            "乌苏市",
            "额敏县",
            "沙湾县",
            "托里县",
            "裕民县",
            "和布克赛尔蒙古自治县",
            "其他"
          ]
        },
        {
          name: "阿勒泰地区",
          area: [
            "阿勒泰市",
            "布尔津县",
            "富蕴县",
            "福海县",
            "哈巴河县",
            "青河县",
            "吉木乃县",
            "其他"
          ]
        },
        {
          name: "石河子",
          area: ["石河子", "其他"]
        },
  
        {
          name: "阿拉尔",
          area: ["阿拉尔", "其他"]
        },
  
        {
          name: "图木舒克",
          area: ["图木舒克", "其他"]
        },
  
        {
          name: "五家渠",
          area: ["五家渠", "其他"]
        },
        {
          name: "北屯市",
          area: ["北屯市", "其他"]
        },
        {
          name: "铁门关市",
          area: ["铁门关市", "其他"]
        },
        {
          name: "双河市",
          area: ["双河市", "其他"]
        },
        {
          name: "可克达拉市",
          area: ["可克达拉市", "其他"]
        },
        {
          name: "昆玉市",
          area: ["昆玉市", "其他"]
        },
        {
          name: "胡杨河市",
          area: ["胡杨河市", "其他"]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "台湾",
      city: [
        {
          name: "台北",
          area: [
            "内湖区",
            "南港区",
            "中正区",
            "万华区",
            "大同区",
            "中山区",
            "松山区",
            "大安区",
            "信义区",
            "文山区",
            "士林区",
            "北投区",
            "其他"
          ]
        },
        {
          name: "新北市",
          area: [
            "板桥区",
            "汐止区",
            "新店区",
            "永和区",
            "中和区",
            "土城区",
            "树林区",
            "三重区",
            "新庄区",
            "芦洲区",
            "瑞芳区",
            "三峡区",
            "莺歌区",
            "淡水区",
            "万里区",
            "金山区",
            "深坑区",
            "石碇区",
            "平溪区",
            "双溪区",
            "贡寮区",
            "坪林区",
            "乌来区",
            "泰山区",
            "林口区",
            "五股区",
            "八里区",
            "三芝区",
            "石门区",
            "其他"
          ]
        },
        {
          name: "桃园市",
          area: [
            "桃园区",
            "中坜区",
            "平镇区",
            "八德区",
            "杨梅区",
            "芦竹区",
            "大溪区",
            "龙潭区",
            "龟山区",
            "大园区",
            "观音区",
            "新屋区",
            "复兴区",
            "其他"
          ]
        },
        {
          name: "台中市",
          area: [
            "中区",
            "东区",
            "南区",
            "西区",
            "北区",
            "北屯区",
            "西屯区",
            "南屯区",
            "太平区",
            "大里区",
            "雾峰区",
            "乌日区",
            "丰原区",
            "后里区",
            "潭子区",
            "大雅区",
            "神冈区",
            "石冈区",
            "东势区",
            "新社区",
            "和平区",
            "大肚区",
            "沙鹿区",
            "龙井区",
            "梧栖区",
            "清水区",
            "大甲区",
            "外埔区",
            "大安区",
            "其他"
          ]
        },
        {
          name: "台南市",
          area: [
            "中西区",
            "东区",
            "南区",
            "北区",
            "安平区",
            "安南区",
            "永康区",
            "归仁区",
            "新化区",
            "左镇区",
            "玉井区",
            "楠西区",
            "南化区",
            "仁德区",
            "关庙区",
            "龙崎区",
            "官田区",
            "麻豆区",
            "佳里区",
            "西港区",
            "七股区",
            "将军区",
            "学甲区",
            "北门区",
            "新营区",
            "后壁区",
            "白河区",
            "东山区",
            "六甲区",
            "下营区",
            "柳营区",
            "盐水区",
            "善化区",
            "大内区",
            "山上区",
            "新市区",
            "安定区",
            "其他"
          ]
        },
        {
          name: "高雄市",
          area: [
            "楠梓区",
            "左营区",
            "鼓山区",
            "三民区",
            "盐埕区",
            "前金区",
            "新兴区",
            "苓雅区",
            "前镇区",
            "旗津区",
            "小港区",
            "凤山区",
            "大寮区",
            "鸟松区",
            "林园区",
            "仁武区",
            "大树区",
            "大社区",
            "冈山区",
            "路竹区",
            "桥头区",
            "梓官区",
            "弥陀区",
            "永安区",
            "燕巢区",
            "阿莲区",
            "茄萣区",
            "湖内区",
            "田寮区",
            "旗山区",
            "美浓区",
            "内门区",
            "杉林区",
            "甲仙区",
            "六龟区",
            "茂林区",
            "桃源区",
            "那玛夏区",
            "其他"
          ]
        },
        {
          name: "其他",
          area: ["其他"]
        }
      ]
    },
  
    {
      name: "澳门",
      city: [
        {
          name: "澳门",
          area: [
            "花地玛堂区",
            "圣安多尼堂区",
            "大堂区",
            "望德堂区",
            "风顺堂区",
            "嘉模堂区",
            "圣方济各堂区",
            "路氹城",
            "其他"
          ]
        }
      ]
    },
  
    {
      name: "香港",
      city: [
        {
          name: "香港",
          area: [
            "中西区",
            "湾仔区",
            "东区",
            "南区",
            "深水埗区",
            "油尖旺区",
            "九龙城区",
            "黄大仙区",
            "观塘区",
            "北区",
            "大埔区",
            "沙田区",
            "西贡区",
            "元朗区",
            "屯门区",
            "荃湾区",
            "葵青区",
            "离岛区",
            "其他"
          ]
        }
      ]
    },
  
    {
      name: "钓鱼岛",
      city: [
        {
          name: "钓鱼岛",
          area: ["钓鱼岛"]
        }
      ]
    }
  ];
  const ListEles = document.querySelectorAll(".addList select");
  let city="";
  let area="";
  for(i in data){
    const Ele = document.createElement("option");
    Ele.innerText=data[i].name;
    Ele.value=data[i].name;
    ListEles[0].appendChild(Ele)
  }
  ListEles[0].addEventListener("change",function(){
    city=data[this.selectedIndex-1].city
    ListEles[1].innerHTML="<option>请选择市</option>";
    ListEles[2].innerHTML="<option>请选择地区</option>";
    for(i of city){
        const Ele = document.createElement("option");
        Ele.innerText=i.name;
        Ele.value=i.name;
        ListEles[1].appendChild(Ele)
    }
  })
  ListEles[1].addEventListener("change",function(){
    area = city[this.selectedIndex-1].area
    ListEles[2].innerHTML="<option>请选择地区</option>";
    for(i of area){
        const Ele = document.createElement("option");
        Ele.innerText=i;
        Ele.value=i;
        ListEles[2].appendChild(Ele)
    }
  })
})